---
kind: property
id: P:Autodesk.Revit.DB.FilledRegion.IsMasking
source: html/2f06036b-8970-0638-470d-379ebd30b46e.htm
---
# Autodesk.Revit.DB.FilledRegion.IsMasking Property

Indicates whether this element is a 'Filled Region or a 'Masking Region'.

## Syntax (C#)
```csharp
public bool IsMasking { get; }
```